nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov13n.yaml' will call yolov13.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 114514]   # Nano
  s: [0.50, 0.50, 114514]   # Small <- use this



backbone: #v13 -> v3
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 1]] # 0
  - [-1, 1, Conv, [64, 3, 2]] # (P1/2)
  - [-1, 1, C3k2, [64, False]]
  - [-1, 1, Conv, [128, 3, 2]] # (P2/4)
  - [-1, 2, C3k2, [128]]
  - [-1, 1, Conv, [256, 3, 2]] # (P3/8)
  - [-1, 8, C3k2, [256, False]]
  - [-1, 1, Conv, [512, 1, 1]] # (P3/8, 512ch)
  - [-1, 1, Conv, [512, 3, 2]] # (P4/16)
  - [-1, 8, C3k2, [512, True, 1.0]]
  - [-1, 1, Conv, [1024, 3, 2]] # (P5/32)
  - [-1, 4, LSKblock, [1024]] # 11

head:
  - [[-5, -3, -1], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both", True]] # 12
  - [-1, 1, DySample, []]
  - [-2, 1, DownsampleConv, [True]]

  - [[-6, -3], 1, FullPAD_Tunnel, []] # 15
  - [[-9, -3], 1, FullPAD_Tunnel, []]
  - [[-6, -3], 1, FullPAD_Tunnel, []]

  - [-1, 1, DySample, []]
  - [[-1, 15], 1, Concat, [1]] #  (cat backbone P4)
  - [-1, 1, C3k2, [512, True]]
  - [[-1, 12], 1, FullPAD_Tunnel, []]

  - [-2, 1, DySample, []]
  - [[-1, 16], 1, Concat, [1]] #  (cat backbone P3)
  - [-1, 1, C3k2, [256, True]]
  - [13, 1, Conv, [256, 1, 1]]
  - [[-2, -1], 1, FullPAD_Tunnel, []] #  (P3/8-small detect output)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 21], 1, Concat, [1]] #  (cat head P4)
  - [-1, 1, C3k2, [512, True]]
  - [[-1, 12], 1, FullPAD_Tunnel, []] #  (P4/16-medium detect output)

  - [-2, 1, Conv, [512, 3, 2]]
  - [[-1, 17], 1, Concat, [1]] #  (cat head P5)
  - [-1, 1, C3k2, [1024, True]]
  - [[-1, 14], 1, FullPAD_Tunnel, []] #  (P5/32-large detect output)

  # Detect(P3, P4, P5)
  - [[-9, -5, -1], 1, Detect, [nc]]
